app/controllers/admin/content_controller.rb

SELECT "tags".* FROM "tags" WHERE (name LIKE '%毛呢外套%' ) ORDER BY name ASC
---
  def auto_complete_for_article_keywords
    @items = Tag.find_with_char params[:article][:keywords].strip

UPDATE "users" SET "settings" = '---
---
  def insert_editor
    editor = (params[:editor].to_s =~ /simple|visual/) ? params[:editor].to_s : "visual"
    current_user.editor = editor
    current_user.save!

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 3 ORDER BY position ASC LIMIT 1
INSERT INTO "categorizations" ("article_id", "category_id", "is_primary") VALUES (3, 3, NULL)
---
  def set_article_categories
    @article.categorizations.clear
    if params[:categories]
      Category.find(params[:categories]).each do |cat|
        @article.categories << cat

SELECT "redirects".* FROM "redirects" WHERE "redirects"."to_path" = 'http://127.0.0.1:3000/2011/12/22/%E8%95%BE%E4%B8%9D%E6%8E%A7%E5%BF%85%E8%B4%A5%E6%AC%BE-%E7%A5%9E%E7%A7%98%E8%95%BE%E4%B8%9D%E4%BF%AE%E8%BA%AB%E6%AC%BE%E8%BF%9E%E8%A1%A3%E8%A3%99-%E4%B8%89%E8%89%B2' LIMIT 1
INSERT INTO "redirects" ("from_path", "to_path", "origin") VALUES ('21zPXp', 'http://127.0.0.1:3000/2011/12/23/%E8%A1%A3%E6%9C%8D%E6%B2%A1%E6%9C%89%E6%80%8E%E4%B9%88%E5%8A%9E', NULL)
---
  def set_shortened_url
    # In a very short time, I'd like to have permalink modification generate a 301 redirect as well to
    # So I set this up the big way now

    return unless Redirect.find_by_to_path(@article.permalink_url).nil?

    red = Redirect.new
    red.from_path = red.shorten
    red.to_path = @article.permalink_url
    red.save