app/controllers/admin/dashboard_controller.rb

  def index
    @newposts = Article.count(:all, :conditions => ['published = ? and published_at > ?', true, current_user.last_venue])
    @newcomments = Feedback.count(:all, :conditions =>['state in (?,?) and published_at > ?', 'presumed_ham', 'ham', current_user.last_venue])
---
SELECT "feedback".* FROM "feedback" WHERE "feedback"."type" = 'Comment' AND (published = 't') ORDER BY created_at DESC LIMIT 5
SELECT COUNT(*) FROM "feedback" WHERE ((("feedback"."type" = 'Feedback' OR "feedback"."type" = 'Comment') OR "feedback"."type" = 'Trackback')) AND (state in ('presumed_ham','ham') and published_at > NULL)